; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v3 - type_3 ?v8 - type_1)
 	      (pred_1 ?v2 - object ?v8 - type_1)
	      (pred_2 ?v3 - type_3 ?v5 - type_2)
	      (pred_4 ?v3 - type_3 ?v2 - object ?v5 - type_2))

   (:action op_2
       :parameters  (?v3 - type_3 ?v7 ?v1 - type_1)
       :precondition (and  (pred_3 ?v3 ?v7))
       :effect (and  (pred_3 ?v3 ?v1)
		     (not (pred_3 ?v3 ?v7))))

   (:action op_1
       :parameters (?v3 - type_3 ?v6 - object ?v4 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_1 ?v6 ?v4) (pred_3 ?v3 ?v4) (pred_2 ?v3 ?v5))
       :effect (and (pred_4 ?v3 ?v6 ?v5)
		    (not (pred_1 ?v6 ?v4)) 
		    (not (pred_2 ?v3 ?v5))))

   (:action op_3
       :parameters (?v3 - type_3 ?v6 - object ?v4 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v3 ?v6 ?v5) (pred_3 ?v3 ?v4))
       :effect (and (pred_1 ?v6 ?v4)
		    (pred_2 ?v3 ?v5)
		    (not (pred_4 ?v3 ?v6 ?v5)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_07 obj_11 - type_3
obj_05 obj_01 obj_03 obj_09 - type_2
obj_04 obj_06 obj_08 - type_1
obj_02 obj_10 obj_12 - object)
(:init
(pred_3 obj_07 obj_06)
(pred_2 obj_07 obj_05)
(pred_2 obj_07 obj_01)
(pred_3 obj_11 obj_06)
(pred_2 obj_11 obj_03)
(pred_2 obj_11 obj_09)
(pred_1 obj_02 obj_04)
(pred_1 obj_10 obj_04)
(pred_1 obj_12 obj_04)
)
(:goal
(and
(pred_1 obj_02 obj_06)
(pred_1 obj_10 obj_08)
(pred_1 obj_12 obj_04)
)
)

(:constraints
  (always (not (pred_3 obj_07 obj_08)))
)
)

; plan
1. (op_2 obj_07 obj_06 obj_04)
   deleted: (pred_3 obj_07 obj_06)
   added: (pred_3 obj_07 obj_04)
   goals met: 1 of 3
2. (op_1 obj_07 obj_10 obj_04 obj_01)
   deleted: (pred_1 obj_10 obj_04) (pred_2 obj_07 obj_01)
   added: (pred_4 obj_07 obj_10 obj_01)
   goals met: 1 of 3
3. (op_1 obj_07 obj_02 obj_04 obj_05)
   deleted: (pred_1 obj_02 obj_04) (pred_2 obj_07 obj_05)
   added: (pred_4 obj_07 obj_02 obj_05)
   goals met: 1 of 3
4. (op_2 obj_07 obj_04 obj_06)
   deleted: (pred_3 obj_07 obj_04)
   added: (pred_3 obj_07 obj_06)
   goals met: 1 of 3
5. (op_3 obj_07 obj_02 obj_06 obj_05)
   deleted: (pred_4 obj_07 obj_02 obj_05)
   added: (pred_1 obj_02 obj_06) (pred_2 obj_07 obj_05)
   goals met: 2 of 3
6. (op_3 obj_07 obj_10 obj_06 obj_01)
   deleted: (pred_4 obj_07 obj_10 obj_01)
   added: (pred_1 obj_10 obj_06) (pred_2 obj_07 obj_01)
   goals met: 2 of 3
7. (op_1 obj_11 obj_10 obj_06 obj_09)
   deleted: (pred_1 obj_10 obj_06) (pred_2 obj_11 obj_09)
   added: (pred_4 obj_11 obj_10 obj_09)
   goals met: 2 of 3
8. (op_2 obj_11 obj_06 obj_08)
   deleted: (pred_3 obj_11 obj_06)
   added: (pred_3 obj_11 obj_08)
   goals met: 2 of 3
9. (op_3 obj_11 obj_10 obj_08 obj_09)
   deleted: (pred_4 obj_11 obj_10 obj_09)
   added: (pred_1 obj_10 obj_08) (pred_2 obj_11 obj_09)
   goals met: 3 of 3
